#Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером. Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех. Т.е. билет с номером 385916 – счастливый, 
#т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.
number = str(input("Введите  номер билета: "))
if number[0] + number[1] + number[2] == number[3] + number[4] + number[5]:
    print("Ваш билет счастливый!")
else: 
    print("Селяви, не ваш день сегодня") 